


# company_day = [
#     [],
#     ['老四川', '麥當勞'],
#     ['肯德基', '胖老爹'],
#     ['逐間', '葉問', '茶六'],
#     ['隨便', 'nupasta', '麵屋武藏', '麵屋壹番'],
#     ['麵屋壹番', '麵屋武藏'],
#     [],
#     []
# ]

# company_items = {
#     '老四川': ['牛肉', '牛肉麵', '豬肉', '羊肉'],
#     '麥當勞': ['麥克雞塊', '麥香雞', '統一', '麥克雞塊'],
#     '肯德基': ['雞腿', '雞腿飯', '雞腿便當'],
#     '胖老爹': ['雞腿', '雞腿飯', '雞腿便當'],
#     '逐間': ['牛肉', '牛肉麵', '豬肉', '羊肉'],
# }

# items_price = {
#     '牛肉': 80,
#     '牛肉麵': 100,
#     '豬肉': 70,
#     '羊肉': 90,
#     '麥克雞塊': 50,
#     '麥香雞': 60,
#     '雞腿便當': 40
# }

prices = {
    '華達士': ['1.5V,4V', 155, 400], 
    '弘揚': ['V,苔,A,芝', 400, 400, 375, 375], 
    '三乃': ['1.5V,大排,2A,2A苔', 155, 165, 160, 170], 
    '超品': ['V,2A,排,豆,起(12)', 400, 165, 175, 85, 255], 
    '新城': ['V', 450], 
    '美琳': ['排,牛排', 175, 225], 
    '洲河': ['V', 420], 
    '山河': ['V', 420], 
    '龍河': ['V', 420], 
    '神河': ['V', 420], 
    '鼎香': ['V', 450], 
    '橋山': ['V,排,培,哈', 440, 90, 235, 240], 
    '楊溢': ['V,排,培,哈', 440, 90, 235, 240], 
    '和達人五': ['V,小排,培,哈,起', 420, 90, 235, 240, 260], 
    '汀州路五': ['V,小排,培,哈,起', 420, 90, 235, 240, 260], 
    '瑞安街五': ['V,小排,培,起', 420, 90, 235, 260], 
    '和達人二': ['V,小排,培,哈,起', 420, 90, 255, 240, 260], 
    '汀州路二': ['V,小排,培,哈,起', 420, 90, 255, 240, 260], 
    '瑞安街二': ['V,小排,培,起', 420, 90, 255, 260], 
    '來可': ['V', 450], '桃鶯': ['V(箱),豆', 2700, 90], 
    '春日': ['V(箱),豆', 2700, 90], 
    '大興': ['V(箱),豆', 2700, 90], 
    '筱芸南平': ['V', 450], 
    '北大昇輝': ['V,豆', 450, 90], 
    '昇輝寶慶': ['V,豆', 450, 90], 
    '桃園寶慶': ['V,豆', 480, 90], 
    '百成一店': ['V(箱),豆', 2700, 90], 
    '北聖': ['V,豆', 450, 90],
    '筱芸中正': ['V', 450], 
    '大園果林': ['V(箱),豆', 2700, 90], 
    '云盛': ['V,排,培,哈', 450, 90, 245, 240], 
    '北大文化二路': ['V,豆', 450, 90], 
    '林口仁愛': ['V,豆', 450, 90], 
    '北大文化三路': ['V,豆', 450, 90], 
    '龍鳳': ['5V,排,4V', 500, 175, 400], 
    '深溪': ['V,豆', 450, 90], 
    '仁樂': ['V,豆', 450, 90], 
    '珍好味': ['V,豆', 450, 90], 
    '新豐': ['V,豆', 450, 90], 
    '福德': ['V,豆', 450, 90], 
    '筱芸中壢': ['V', 450]
}

def bill_overview(orders):
    sum = 0
    for order in orders:
        # items = order.item.split(',')
        num_items = order.num_item.split('.')
        company_price = prices[order.customer][1:]

        # print(company_price, order.num_item[i])
        for price, num in zip(company_price, num_items):
            sum += price * int(num)
        print(f'price = {company_price}')
        print(f'num_items = {num_items}')
        print(f'cur sum = {sum}')

        # price[order.customer]
        # print(order.customer, order.item, order.num_item, order.date)
        # print(order.customer, order.items, order.date)

    return orders
    pass

def order_precess(unplitted):
    # data form '1,2,3,4,5,6,7,0,2,0'
    unplitted = unplitted.strip().split(',')
    return unplitted