


# company_day = [
#     [],
#     ['老四川', '麥當勞'],
#     ['肯德基', '胖老爹'],
#     ['逐間', '葉問', '茶六'],
#     ['隨便', 'nupasta', '麵屋武藏', '麵屋壹番'],
#     ['麵屋壹番', '麵屋武藏'],
#     [],
#     []
# ]

# company_items = {
#     '老四川': ['牛肉', '牛肉麵', '豬肉', '羊肉'],
#     '麥當勞': ['麥克雞塊', '麥香雞', '統一', '麥克雞塊'],
#     '肯德基': ['雞腿', '雞腿飯', '雞腿便當'],
#     '胖老爹': ['雞腿', '雞腿飯', '雞腿便當'],
#     '逐間': ['牛肉', '牛肉麵', '豬肉', '羊肉'],
# }

# items_price = {
#     '牛肉': 80,
#     '牛肉麵': 100,
#     '豬肉': 70,
#     '羊肉': 90,
#     '麥克雞塊': 50,
#     '麥香雞': 60,
#     '雞腿便當': 40
# }


def order_precess(unplitted):
    # data form '1,2,3,4,5,6,7,0,2,0'
    unplitted = unplitted.strip().split(',')
    return unplitted